scipy.in-2011-intro-tut/numpy-scipy-git.html

<!DOCTYPE html>
<!--
  Copyright 2010 Google Inc.

  Licensed under the Apache License, Version 2.0 (the "License");
  you may not use this file except in compliance with the License.
  You may obtain a copy of the License at

     http://www.apache.org/licenses/LICENSE-2.0

  Unless required by applicable law or agreed to in writing, software
  distributed under the License is distributed on an "AS IS" BASIS,
  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  See the License for the specific language governing permissions and
  limitations under the License.

  Original slides: Marcin Wichary (mwichary@google.com)
  Modifications: Ernest Delgado (ernestd@google.com)
		 Alex Russell (slightlyoff@chromium.org)
		 Brad Neuberg
-->
<html>
<head>
<title>Introduction to NumPy, SciPy, Matplotlib and Git</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta http-equiv="X-UA-Compatible" content="chrome=1">
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-12-06 13:05:35 IST"/>
<meta name="author" content="Puneeth Chaganti"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div class="presentation">
<div id="content">


<div class="slide">
  <section class="center intro">
    <style>
      span.strike { text-decoration:line-through;}
    </style>
    <h2>
      Introduction to NumPy, SciPy, Matplotlib and Git
    </h2>
    <p style="margin-top:100px">
      Puneeth Chaganti
    </p>
    <p style="font-size: 25px; line-height: 180%;">Press <span class="key">&rarr;</span> key to advance.<br />
    Zoom in/out: <span class="key">Ctrl or Command</span> + <span class="key">+/-</span></p>
  </section>
</div>

<div class="slide">
<header><h1>Introduction </h1></header>

<section>
<ul class="summary">
<li>Refresher
</li>
<li>Hands on
</li>
<li>Experimental, Feedback of audience
</li>
<li>Data-file: <a href="http://bit.ly/rSEw6Q">http://bit.ly/rSEw6Q</a>
</li>
</ul>

</section>

</div>

<div class="slide">
<header><h1>IPython </h1></header>

<section>
<ul class="summary">
<li>Tab-completion
<ul class="summary">
<li>imports
</li>
<li>file-names
</li>
<li>variables
</li>
</ul>

</li>
<li>Magic commands
<ul class="summary">
<li><code>%hist</code>, <code>%save</code>, <code>%run</code>
</li>
</ul>

</li>
<li>Shell commands
<ul class="summary">
<li><code>cd</code>, <code>ls</code>, <code>pwd</code>
</li>
</ul>

</li>
<li>Help (?) and Source (??)
</li>
</ul>

</section>

</div>

<div class="slide">
<header><h1>Numpy </h1></header>

<section>
<ul class="summary">
<li>Arrays
</li>
<li>Fundamental building block &ndash; designed for convenience
</li>
<li>Homogeneous, (therefore) Fast
</li>
</ul>

</section>

</div>

<div class="slide">
<header><h1>Arrays &ndash; Basics </h1></header>

<section>
<ul class="summary">
<li>1D
<ul class="summary">
<li><code>loadtxt</code>
<ul class="summary">
<li>arguments?
</li>
</ul>

</li>
<li><code>sum</code>, <code>min</code>, <code>max</code>
</li>
</ul>

</li>
<li>2D
<ul class="summary">
<li><code>shape</code>
</li>
<li>accessing elements, rows, columns
<ul class="summary">
<li>score, matches, 50s, 100s
</li>
<li>2003, 2003&ndash;2007
</li>
</ul>

</li>
</ul>

</li>
</ul>

</section>

</div>

<div class="slide">
<header><h1>Plotting </h1></header>

<section>
<ul class="summary">
<li>Plot yearly score
</li>
<li>Plot number of centuries
<ul class="summary">
<li><code>title</code>
</li>
<li><code>xlabel</code>
</li>
<li><code>ylabel</code>
</li>
<li><code>legend</code>
</li>
</ul>

</li>
</ul>

</section>

</div>

<div class="slide">
<header><h1>Element-wise Operations </h1></header>

<section>
<ul class="summary">
<li>Array operations are elementwise
<ul class="summary">
<li>average of each year
</li>
<li>total average
</li>
<li>plot average
</li>
</ul>

</li>
</ul>

</section>

</div>

<div class="slide">
<header><h1>Fancy &amp; Boolean indexing </h1></header>

<section>
<ul class="summary">
<li>Find the years in which average was above 40
</li>
<li>Find the average in all world cup years
</li>
</ul>

</section>

</div>

<div class="slide">
<header><h1>Creating Arrays </h1></header>

<section>
<ul class="summary">
<li><code>array</code>
</li>
<li><code>linspace</code>
</li>
<li><code>arange</code>
</li>
<li><code>zeros</code>
</li>
<li><code>ones</code>
</li>
<li><code>rand</code>
</li>
</ul>

</section>

</div>

<div class="slide">
<header><h1>Copies, View </h1></header>

<section>



<pre class="src src-python">a = np.arange(10)
b = a[4:8]
b[0] = 0
<span class="org-py-builtins">print</span> b
<span class="org-py-builtins">print</span> a
</pre>

</section>

</div>

<div class="slide">
<header><h1>Broadcasting </h1></header>

<section>
<ul class="summary">
<li>Combining arrays of different sizes
</li>
<li>Simple scalar operation
</li>
<li>How?
<ul class="summary">
<li>Compare dimensions, starting from last
</li>
<li>Match when either dimension is one or None, or if dimensions are equal



<pre class="example">Scalar    2D        3D            No go

( ,)      (3, 4)    (3, 5, 1)     (3, 5, 2)
(3,)      (3, 1)    (      8)     (      8)
----      ------    ----------    ---------
(3,)      (3, 4)    (3, 5, 8)        XXX
</pre>

</li>
</ul>

</section>

</div>

<div class="slide">
<header><h1>SciPy </h1></header>

<section>
<ul class="summary">
<li><a href="http://docs.scipy.org/scipy">http://docs.scipy.org/scipy</a>
</li>
<li><code>scipy?</code>
</li>
<li><code>solve</code>



<pre class="src src-python"><span class="org-keyword">from</span> scipy.linalg <span class="org-keyword">import</span> solve
A = array([[3,2,-1],
           [2,-2,4],
           [-1, 0.5, -1]])
b = array([1, -2, 0])
x = solve(A, b)
</pre>

</li>
<li><code>integrate</code>



<pre class="src src-python"><span class="org-keyword">from</span> scipy.integrate <span class="org-keyword">import</span> quad
res, err = quad(np.sin, 0, np.pi/2)
np.allclose(res, 1)
</pre>

</li>
</ul>

</section>

</div>

<div class="slide">
<header><h1>Git (1) </h1></header>

<section>

<p>
  Courtesy: <a href="https://github.com/diaspora/diaspora/wiki/Git-Workflow">Diaspora</a>
</p>
<ul class="summary">
<li>Create a GitHub account
</li>
<li>Fork on GitHub (click Fork button)
</li>
<li>Clone to computer
</li>
<li>Don't forget to cd into your repo
</li>
<li>Set up remote upstream
</li>
</ul>

</section>

</div>

<div class="slide">
<header><h1>Git (2) </h1></header>

<section>
<ul class="summary">
<li>Create a branch for new issue
</li>
<li>Develop on issue branch
</li>
<li>Commit changes to issue branch
</li>
<li>Fetch upstream
</li>
</ul>

</section>

</div>

<div class="slide">
<header><h1>Git (3) </h1></header>

<section>
<ul class="summary">
<li>Update local master
</li>
<li>Repeat steps in previous slide till dev is complete
</li>
<li>Rebase issue branch
</li>
<li>Push branch to GitHub
</li>
<li>Issue pull request (Click Pull Request button)
</li>
</ul>




</section>

</div>

<div class="slide">
<header><h1>References </h1></header>

<section>
<ul class="summary">
<li><a href="https://github.com/scipy-lectures/scipy-lecture-notes">https://github.com/scipy-lectures/scipy-lecture-notes</a>
</li>
<li><a href="https://github.com/FOSSEE/workshops">https://github.com/FOSSEE/workshops</a>
</li>
<li><a href="http://mentat.za.net/numpy/numpy_advanced_slides/">http://mentat.za.net/numpy/numpy_advanced_slides/</a>
</li>
<li><a href="https://github.com/diaspora/diaspora/wiki/Git-Workflow">https://github.com/diaspora/diaspora/wiki/Git-Workflow</a>
</li>
<li><a href="http://howstat.com">http://howstat.com</a>
</li>
</ul>


</section>
</div>

</div>
<script>
  (function() {
    // Since we don't have the fallback of attachEvent and
    // other IE only stuff we won't try to run JS for IE.
    // It will run though when using Google Chrome Frame
    if (document.all) { return; }

    var currentSlideNo;
    var notesOn = false;
    var slides = document.getElementsByClassName('slide');
    var touchStartX = 0;

    // var slide_hash = window.location.hash.replace(/#/, '');
    // if (slide_hash) {
    //   for (var i = 0, len = slides.length; i < len; i++) {
    //     if (slides[i].id == slide_hash) {
    //       currentSlideNo = i;
    //       updateSlideClasses();
    //     }
    //   }
    // }

    var spaces = /\s+/, a1 = [""];

    var str2array = function(s) {
      if (typeof s == "string" || s instanceof String) {
	if (s.indexOf(" ") < 0) {
	  a1[0] = s;
	  return a1;
	} else {
	  return s.split(spaces);
	}
      }
      return s;
    };

    var trim = function(str) {
      return str.replace(/^\s\s*/, '').replace(/\s\s*$/, '');
    };

    var addClass = function(node, classStr) {
      classStr = str2array(classStr);
      var cls = " " + node.className + " ";
      for (var i = 0, len = classStr.length, c; i < len; ++i) {
	c = classStr[i];
	if (c && cls.indexOf(" " + c + " ") < 0) {
	  cls += c + " ";
	}
      }
      node.className = trim(cls);
    };

    var removeClass = function(node, classStr) {
      var cls;
      if (classStr !== undefined) {
	classStr = str2array(classStr);
	cls = " " + node.className + " ";
	for (var i = 0, len = classStr.length; i < len; ++i) {
	  cls = cls.replace(" " + classStr[i] + " ", " ");
	}
	cls = trim(cls);
      } else {
	cls = "";
      }
      if (node.className != cls) {
	node.className = cls;
      }
    };

    var getSlideEl = function(slideNo) {
      if (slideNo > 0) {
	return slides[slideNo - 1];
      } else {
	return null;
      }
    };

    var getSlideTitle = function(slideNo) {
      var el = getSlideEl(slideNo);

      if (el) {
	return el.getElementsByTagName('header')[0].innerHTML;
      } else {
	return null;
      }
    };

    var changeSlideElClass = function(slideNo, className) {
      var el = getSlideEl(slideNo);

      if (el) {
	removeClass(el, 'far-past past current future far-future');
	addClass(el, className);
      }
    };

    var updateSlideClasses = function() {
      window.location.hash = "slide" + currentSlideNo;
      changeSlideElClass(currentSlideNo - 2, 'far-past');
      changeSlideElClass(currentSlideNo - 1, 'past');
      changeSlideElClass(currentSlideNo, 'current');
      changeSlideElClass(currentSlideNo + 1, 'future');
      changeSlideElClass(currentSlideNo + 2, 'far-future');
    };

    var nextSlide = function() {
      if (currentSlideNo < slides.length) {
	currentSlideNo++;
      }

      updateSlideClasses();
    };

    var prevSlide = function() {
      if (currentSlideNo > 1) {
	currentSlideNo--;
      }
      updateSlideClasses();
    };

    var showNotes = function() {
      var notes = document.querySelectorAll('.notes');
      for (var i = 0, len = notes.length; i < len; i++) {
	notes[i].style.display = (notesOn) ? 'none':'block';
      }
      notesOn = (notesOn) ? false:true;
    };

    var switch3D = function() {
      if (document.body.className.indexOf('three-d') == -1) {
	document.getElementsByClassName('presentation')[0].style.webkitPerspective = '1000px';
	document.body.className += ' three-d';
      } else {
	window.setTimeout("document.getElementsByClassName('presentation')[0].style.webkitPerspective = '0';", 2000);
	document.body.className = document.body.className.replace(/three-d/, '');
      }
    };

    var handleBodyKeyDown = function(event) {
      // console.log(event.keyCode);
      switch (event.keyCode) {
	case 37: // left arrow
	  prevSlide();
	  break;
	case 39: // right arrow
	// case 32: // space
	  nextSlide();
	  break;
	case 50: // 2
	  showNotes();
	  break;
	case 51: // 3
	  switch3D();
	  break;
      }
    };

    var addTouchListeners = function() {
      document.addEventListener('touchstart', function(e) {
	touchStartX = e.touches[0].pageX;
      }, false);
      document.addEventListener('touchend', function(e) {
	var pixelsMoved = touchStartX - e.changedTouches[0].pageX;
	var SWIPE_SIZE = 150;
	if (pixelsMoved > SWIPE_SIZE) {
	  nextSlide();
	}
	else if (pixelsMoved < -SWIPE_SIZE) {
	 prevSlide();
	}
      }, false);
    };

    // initialize

    (function() {
      if (window.location.hash != "") {
	currentSlideNo = Number(window.location.hash.replace('#slide', ''));
      } else {
	currentSlideNo = 1;
      }

      document.addEventListener('keydown', handleBodyKeyDown, false);

      var els = slides;
      for (var i = 0, el; el = els[i]; i++) {
	addClass(el, 'slide far-future');
      }
      updateSlideClasses();

      // add support for finger events (filter it by property detection?)
      addTouchListeners();
    })();
  })();
</script>
</body>
</html>
